presentation.org
#    -*- mode: org -*-
#+OPTIONS: reveal_center:t reveal_progress:nil reveal_history:nil reveal_control:nil
#+OPTIONS: reveal_mathjax:t reveal_rolling_links:nil reveal_keyboard:t reveal_overview:t num:nil
#+OPTIONS: reveal_width:1600 reveal_height:900
#+OPTIONS: toc:nil <:nil timestamp:nil email:t reveal_slide_number:"c/t"
#+REVEAL_MARGIN: 0.1
#+REVEAL_MIN_SCALE: 0.5
#+REVEAL_MAX_SCALE: 2.5
#+REVEAL_TRANS: none
#+REVEAL_THEME: blood
#+REVEAL_HLEVEL: 1
#+REVEAL_EXTRA_CSS: ./presentation.css
#+REVEAL_ROOT: ../reveal.js/

#+TITLE: Concepts & Subsumption
#+AUTHOR: Ben Deane
#+DATE: 3rd December 2020

#+REVEAL_HTML: <script type="text/javascript" src="./presentation.js"></script>

#+REVEAL_TITLE_SLIDE: <h2>%t</h2><h3>A brief guide to constraining function overloads</h3><h3>%a / <a href=\"http://twitter.com/ben_deane\">@ben_deane</a></h3><h4>%d</h4>

* Settings                                                         :noexport:
#+begin_source elisp
(set-face-foreground 'font-lock-comment-face "magenta")
(set-face-foreground 'font-lock-comment-delimiter-face "magenta")
#+end_source

* Concepts vs Type Traits

A ~concept~ is "morally equivalent" to a type trait. It's a predicate on a type.

#+begin_src c++ -n
template <typename T>
using area_t = decltype(std::declval<T>().area());

template <typename T>
using has_area_t = std::experimental::is_detected<area_t, T>;

template <typename T>
constexpr auto has_area_v = has_area_t<T>::value;

template <typename T>
concept has_area = requires (T t) {
  { t.area() } -> std::same_as<std::size_t>;
};
#+end_src

#+begin_notes
This is the detection idiom from library fundamentals v2.
It is now superseded by concepts in most cases.

Note that the concept checks not just the syntactic validity of calling ~area~
but also the return value.
#+end_notes

* Concepts vs Type Traits

 - Type traits typically inherit from ~std::true_type~ or ~std::false_type~.
 - Type traits have a corresponding ~constexpr bool~ variable template.
 - Concepts usually are not "hungarian".

Concepts and type traits can be implemented in terms of each other:

#+begin_src c++ -n
template <typename T>
concept has_area = has_area_v<T>;

template <typename T>
using has_area_t = std::bool_constant<has_area<T>>;

template <typename T>
constexpr auto has_area_v = has_area<T>;
#+end_src

#+begin_notes
You can /only/ implement a concept with a ~constexpr bool~. You can't directly
use an object of type ~std::true_type~ or ~std::false_type~, even though those types have
implicit conversion to ~bool~.
#+end_notes

* Concepts do more than type traits

 - Better error messages
 - Faster compilation
 - Much easier to express return type checks
 - Can constrain non-template functions too (compare: ~= delete~)
 - Easier (?) to combine

#+begin_notes
This last part is really what we're exploring here.
#+end_notes

* Constraining functions

Let's make some shape concepts to constrain our functions.

#+begin_src c++ -n
template <typename T>
concept basic_shape = requires (T t) {
  { t.area() } -> std::same_as<std::size_t>;
};

template <typename T>
concept shape = requires (T t) {
  basic_shape<T>; // DRY
  { t.perimeter() } -> std::same_as<std::size_t>;
};
#+end_src

(Discussion of what makes a /good/ concept is for another talk.)

