presentation.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Concepts &amp; Subsumption</title>
<meta name="author" content="Ben Deane"/>
<link rel="stylesheet" href="../reveal.js/css/reveal.css"/>

<link rel="stylesheet" href="../reveal.js/css/theme/blood.css" id="theme"/>

<link rel="stylesheet" href="./presentation.css"/>

<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide">
<h2>Concepts &amp; Subsumption</h2><h3>A brief guide to constraining function overloads</h3><h3>Ben Deane / <a href=\"http://twitter.com/ben_deane\">@ben_deane</a></h3><h4>3rd December 2020</h4>
</section>
<script type="text/javascript" src="./presentation.js"></script>

<section>
<section id="slide-org3ffb879">
<h2 id="org3ffb879">Concepts vs Type Traits</h2>
<p>
A <code>concept</code> is "morally equivalent" to a type trait. It's a predicate on a type.
</p>

<div class="org-src-container">

<pre  class="src src-c++"><span class="linenr"> 1: </span><span style="color: #b58900; font-weight: bold;">template</span> <span style="color: #2aa198;">&lt;</span><span style="color: #b58900; font-weight: bold;">typename</span> <span style="color: #268bd2;">T</span><span style="color: #2aa198;">&gt;</span>
<span class="linenr"> 2: </span><span style="color: #b58900; font-weight: bold;">using</span> <span style="color: #268bd2;">area_t</span> = <span style="color: #b58900; font-weight: bold;">decltype</span><span style="color: #2aa198;">(</span><span style="color: #859900;">std</span>::declval<span style="color: #b58900;">&lt;</span><span style="color: #268bd2;">T</span><span style="color: #b58900;">&gt;()</span>.area<span style="color: #b58900;">()</span><span style="color: #2aa198;">)</span>;
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span><span style="color: #b58900; font-weight: bold;">template</span> <span style="color: #2aa198;">&lt;</span><span style="color: #b58900; font-weight: bold;">typename</span> <span style="color: #268bd2;">T</span><span style="color: #2aa198;">&gt;</span>
<span class="linenr"> 5: </span><span style="color: #b58900; font-weight: bold;">using</span> <span style="color: #268bd2;">has_area_t</span> = <span style="color: #859900;">std</span>::<span style="color: #859900;">experimental</span>::<span style="color: #268bd2;">is_detected</span><span style="color: #2aa198;">&lt;</span><span style="color: #268bd2;">area_t</span>, <span style="color: #268bd2;">T</span><span style="color: #2aa198;">&gt;</span>;
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span><span style="color: #b58900; font-weight: bold;">template</span> <span style="color: #2aa198;">&lt;</span><span style="color: #b58900; font-weight: bold;">typename</span> <span style="color: #268bd2;">T</span><span style="color: #2aa198;">&gt;</span>
<span class="linenr"> 8: </span><span style="color: #b58900; font-weight: bold;">constexpr</span> <span style="color: #b58900; font-weight: bold;">auto</span> <span style="color: #cb4b16;">has_area_v</span> = <span style="color: #859900;">has_area_t</span><span style="color: #2aa198;">&lt;</span><span style="color: #268bd2;">T</span><span style="color: #2aa198;">&gt;</span>::value;
<span class="linenr"> 9: </span>
<span class="linenr">10: </span><span style="color: #b58900; font-weight: bold;">template</span> <span style="color: #2aa198;">&lt;</span><span style="color: #b58900; font-weight: bold;">typename</span> <span style="color: #268bd2;">T</span><span style="color: #2aa198;">&gt;</span>
<span class="linenr">11: </span><span style="color: #268bd2;">concept</span> <span style="color: #cb4b16;">has_area</span> = <span style="color: #b58900; font-weight: bold;">requires</span> <span style="color: #2aa198;">(</span><span style="color: #268bd2;">T</span> <span style="color: #cb4b16;">t</span><span style="color: #2aa198;">)</span> <span style="color: #2aa198;">{</span>
<span class="linenr">12: </span>  <span style="color: #b58900;">{</span> t.area<span style="color: #94BFF3;">()</span> <span style="color: #b58900;">}</span> -&gt; <span style="color: #859900;">std</span>::<span style="color: #268bd2;">same_as</span><span style="color: #b58900;">&lt;</span><span style="color: #859900;">std</span>::size_t<span style="color: #b58900;">&gt;</span>;
<span class="linenr">13: </span><span style="color: #2aa198;">}</span>;
</pre>
</div>

<aside class="notes">
<p>
This is the detection idiom from library fundamentals v2.
It is now superseded by concepts in most cases.
</p>

<p>
Note that the concept checks not just the syntactic validity of calling <code>area</code>
but also the return value.
</p>

</aside>

</section>
</section>
<section>
<section id="slide-org2b8d291">
<h2 id="org2b8d291">Concepts vs Type Traits</h2>
<ul>
<li>Type traits typically inherit from <code>std::true_type</code> or <code>std::false_type</code>.</li>
<li>Type traits have a corresponding <code>constexpr bool</code> variable template.</li>
<li>Concepts usually are not "hungarian".</li>

</ul>

<p>
Concepts and type traits can be implemented in terms of each other:
</p>

<div class="org-src-container">

<pre  class="src src-c++"><span class="linenr">1: </span><span style="color: #b58900; font-weight: bold;">template</span> <span style="color: #2aa198;">&lt;</span><span style="color: #b58900; font-weight: bold;">typename</span> <span style="color: #268bd2;">T</span><span style="color: #2aa198;">&gt;</span>
<span class="linenr">2: </span><span style="color: #268bd2;">concept</span> <span style="color: #cb4b16;">has_area</span> = <span style="color: #268bd2;">has_area_v</span><span style="color: #2aa198;">&lt;</span><span style="color: #268bd2;">T</span><span style="color: #2aa198;">&gt;</span>;
<span class="linenr">3: </span>
<span class="linenr">4: </span><span style="color: #b58900; font-weight: bold;">template</span> <span style="color: #2aa198;">&lt;</span><span style="color: #b58900; font-weight: bold;">typename</span> <span style="color: #268bd2;">T</span><span style="color: #2aa198;">&gt;</span>
<span class="linenr">5: </span><span style="color: #b58900; font-weight: bold;">using</span> <span style="color: #268bd2;">has_area_t</span> = <span style="color: #859900;">std</span>::<span style="color: #268bd2;">bool_constant</span><span style="color: #2aa198;">&lt;</span><span style="color: #268bd2;">has_area</span><span style="color: #b58900;">&lt;</span><span style="color: #268bd2;">T</span><span style="color: #b58900;">&gt;</span><span style="color: #2aa198;">&gt;</span>;
<span class="linenr">6: </span>
<span class="linenr">7: </span><span style="color: #b58900; font-weight: bold;">template</span> <span style="color: #2aa198;">&lt;</span><span style="color: #b58900; font-weight: bold;">typename</span> <span style="color: #268bd2;">T</span><span style="color: #2aa198;">&gt;</span>
<span class="linenr">8: </span><span style="color: #b58900; font-weight: bold;">constexpr</span> <span style="color: #b58900; font-weight: bold;">auto</span> <span style="color: #cb4b16;">has_area_v</span> = <span style="color: #268bd2;">has_area</span><span style="color: #2aa198;">&lt;</span><span style="color: #268bd2;">T</span><span style="color: #2aa198;">&gt;</span>;
</pre>
</div>

<aside class="notes">
<p>
You can <i>only</i> implement a concept with a <code>constexpr bool</code>. You can't directly
use an object of type <code>std::true_type</code> or <code>std::false_type</code>, even though those types have
implicit conversion to <code>bool</code>.
</p>

</aside>

</section>
</section>
<section>
<section id="slide-orgf1bab77">
<h2 id="orgf1bab77">Concepts do more than type traits</h2>
<ul>
<li>Better error messages</li>
<li>Faster compilation</li>
<li>Much easier to express return type checks</li>
<li>Can constrain non-template functions too (compare: <code>= delete</code>)</li>
<li>Easier (?) to combine</li>

</ul>

<aside class="notes">
<p>
This last part is really what we're exploring here.
</p>

</aside>

</section>
</section>
<section>
<section id="slide-orgd133b86">
<h2 id="orgd133b86">Constraining functions</h2>
<p>
Let's make some shape concepts to constrain our functions.
</p>

<div class="org-src-container">

<pre  class="src src-c++"><span class="linenr"> 1: </span><span style="color: #b58900; font-weight: bold;">template</span> <span style="color: #2aa198;">&lt;</span><span style="color: #b58900; font-weight: bold;">typename</span> <span style="color: #268bd2;">T</span><span style="color: #2aa198;">&gt;</span>
<span class="linenr"> 2: </span><span style="color: #268bd2;">concept</span> <span style="color: #cb4b16;">basic_shape</span> = <span style="color: #b58900; font-weight: bold;">requires</span> <span style="color: #2aa198;">(</span><span style="color: #268bd2;">T</span> <span style="color: #cb4b16;">t</span><span style="color: #2aa198;">)</span> <span style="color: #2aa198;">{</span>
<span class="linenr"> 3: </span>  <span style="color: #b58900;">{</span> t.area<span style="color: #94BFF3;">()</span> <span style="color: #b58900;">}</span> -&gt; <span style="color: #859900;">std</span>::<span style="color: #268bd2;">same_as</span><span style="color: #b58900;">&lt;</span><span style="color: #859900;">std</span>::size_t<span style="color: #b58900;">&gt;</span>;
<span class="linenr"> 4: </span><span style="color: #2aa198;">}</span>;
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span><span style="color: #b58900; font-weight: bold;">template</span> <span style="color: #2aa198;">&lt;</span><span style="color: #b58900; font-weight: bold;">typename</span> <span style="color: #268bd2;">T</span><span style="color: #2aa198;">&gt;</span>
<span class="linenr"> 7: </span><span style="color: #268bd2;">concept</span> <span style="color: #cb4b16;">shape</span> = <span style="color: #b58900; font-weight: bold;">requires</span> <span style="color: #2aa198;">(</span><span style="color: #268bd2;">T</span> <span style="color: #cb4b16;">t</span><span style="color: #2aa198;">)</span> <span style="color: #2aa198;">{</span>
<span class="linenr"> 8: </span>  <span style="color: #268bd2;">basic_shape</span><span style="color: #b58900;">&lt;</span><span style="color: #268bd2;">T</span><span style="color: #b58900;">&gt;</span>; <span style="color: #ff00ff;">// </span><span style="color: #ff00ff;">DRY</span>
<span class="linenr"> 9: </span>  <span style="color: #b58900;">{</span> t.perimeter<span style="color: #94BFF3;">()</span> <span style="color: #b58900;">}</span> -&gt; <span style="color: #859900;">std</span>::<span style="color: #268bd2;">same_as</span><span style="color: #b58900;">&lt;</span><span style="color: #859900;">std</span>::size_t<span style="color: #b58900;">&gt;</span>;
<span class="linenr">10: </span><span style="color: #2aa198;">}</span>;
</pre>
</div>

<p>
(Discussion of what makes a <i>good</i> concept is for another talk.)
</p>

</section>
</section>
