presentation.org
* Constraining functions

Here are some shape classes that variously fulfil our concepts.

#+begin_src c++ -n
struct rectangle {
  auto area() -> std::size_t;
  auto perimeter() -> std::size_t;
};
static_assert(basic_shape<rectangle>);
static_assert(shape<rectangle>);

struct ellipse {
  auto area() -> std::size_t;
  // don't know how to calculate perimeter
};
static_assert(basic_shape<ellipse>);
static_assert(not shape<ellipse>);
#+end_src

* Constraining functions

Now we're all good to start constraining functions.

#+begin_src c++ -n
auto calc(shape auto const& s) -> void;
auto calc(basic_shape auto const& s) -> void;

int main() {
  ellipse e;
  calc(e); // calls calc at line 2

  rectangle r;
  calc(r); // ambiguous?
}
#+end_src

#+begin_src sh
<source>:38:5: error: call to 'calc' is ambiguous
    calc(r);
    ^~~~
<source>:30:6: note: candidate function [with s:auto = rectangle]
auto calc(shape auto const& s) -> void;
     ^
<source>:31:6: note: candidate function [with s:auto = rectangle]
auto calc(basic_shape auto const& s) -> void;
#+end_src

* Constraining functions

Why isn't the function that takes a ~shape~\\
more constrained than the function that takes a ~basic_shape~?

#+begin_src c++ -n
template <typename T>
concept basic_shape = requires (T t) {
  { t.area() } -> std::same_as<std::size_t>;
};

template <typename T>
concept shape = requires (T t) {
  basic_shape<T>; // DRY
  { t.perimeter() } -> std::same_as<std::size_t>;
};

auto calc(shape auto const& s) -> void;
auto calc(basic_shape auto const& s) -> void;
#+end_src

* Concept subsumption

The answer is concept subsumption: how the compiler decides whether one concept
is "more powerful/constraining" another.

#+begin_src c++ -n
auto calc(shape auto const& s) -> void;
auto calc(basic_shape auto const& s) -> void;
#+end_src

To consider one (concept-constrained) function more constrained than another,
the concept(s) constraining function A must /subsume/ the concept(s)
constraining function B.

What does that mean?

