presentation.html
<section>
<section id="slide-org262f64f">
<h2 id="org262f64f">Constraining functions</h2>
<p>
Here are some shape classes that variously fulfil our concepts.
</p>

<div class="org-src-container">

<pre  class="src src-c++"><span class="linenr"> 1: </span><span style="color: #b58900; font-weight: bold;">struct</span> <span style="color: #268bd2;">rectangle</span> <span style="color: #2aa198;">{</span>
<span class="linenr"> 2: </span>  <span style="color: #b58900; font-weight: bold;">auto</span> <span style="color: #2aa198;">area</span><span style="color: #b58900;">()</span> -&gt; <span style="color: #859900;">std</span>::<span style="color: #268bd2;">size_t</span>;
<span class="linenr"> 3: </span>  <span style="color: #b58900; font-weight: bold;">auto</span> <span style="color: #2aa198;">perimeter</span><span style="color: #b58900;">()</span> -&gt; <span style="color: #859900;">std</span>::<span style="color: #268bd2;">size_t</span>;
<span class="linenr"> 4: </span><span style="color: #2aa198;">}</span>;
<span class="linenr"> 5: </span><span style="color: #b58900; font-weight: bold;">static_assert</span><span style="color: #2aa198;">(</span><span style="color: #268bd2;">basic_shape</span><span style="color: #b58900;">&lt;</span><span style="color: #268bd2;">rectangle</span><span style="color: #b58900;">&gt;</span><span style="color: #2aa198;">)</span>;
<span class="linenr"> 6: </span><span style="color: #b58900; font-weight: bold;">static_assert</span><span style="color: #2aa198;">(</span><span style="color: #268bd2;">shape</span><span style="color: #b58900;">&lt;</span><span style="color: #268bd2;">rectangle</span><span style="color: #b58900;">&gt;</span><span style="color: #2aa198;">)</span>;
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span><span style="color: #b58900; font-weight: bold;">struct</span> <span style="color: #268bd2;">ellipse</span> <span style="color: #2aa198;">{</span>
<span class="linenr"> 9: </span>  <span style="color: #b58900; font-weight: bold;">auto</span> <span style="color: #2aa198;">area</span><span style="color: #b58900;">()</span> -&gt; <span style="color: #859900;">std</span>::<span style="color: #268bd2;">size_t</span>;
<span class="linenr">10: </span>  <span style="color: #ff00ff;">// </span><span style="color: #ff00ff;">don't know how to calculate perimeter</span>
<span class="linenr">11: </span><span style="color: #2aa198;">}</span>;
<span class="linenr">12: </span><span style="color: #b58900; font-weight: bold;">static_assert</span><span style="color: #2aa198;">(</span><span style="color: #268bd2;">basic_shape</span><span style="color: #b58900;">&lt;</span><span style="color: #268bd2;">ellipse</span><span style="color: #b58900;">&gt;</span><span style="color: #2aa198;">)</span>;
<span class="linenr">13: </span><span style="color: #b58900; font-weight: bold;">static_assert</span><span style="color: #2aa198;">(</span><span style="color: #b58900; font-weight: bold;">not</span> <span style="color: #268bd2;">shape</span><span style="color: #b58900;">&lt;</span><span style="color: #268bd2;">ellipse</span><span style="color: #b58900;">&gt;</span><span style="color: #2aa198;">)</span>;
</pre>
</div>

</section>
</section>
<section>
<section id="slide-org8b93ed0">
<h2 id="org8b93ed0">Constraining functions</h2>
<p>
Now we're all good to start constraining functions.
</p>

<div class="org-src-container">

<pre  class="src src-c++"><span class="linenr"> 1: </span><span style="color: #b58900; font-weight: bold;">auto</span> <span style="color: #2aa198;">calc</span><span style="color: #2aa198;">(</span><span style="color: #268bd2;">shape</span> <span style="color: #b58900; font-weight: bold;">auto</span> <span style="color: #b58900; font-weight: bold;">const</span>&amp; <span style="color: #cb4b16;">s</span><span style="color: #2aa198;">)</span> -&gt; <span style="color: #268bd2;">void</span>;
<span class="linenr"> 2: </span><span style="color: #b58900; font-weight: bold;">auto</span> <span style="color: #2aa198;">calc</span><span style="color: #2aa198;">(</span><span style="color: #268bd2;">basic_shape</span> <span style="color: #b58900; font-weight: bold;">auto</span> <span style="color: #b58900; font-weight: bold;">const</span>&amp; <span style="color: #cb4b16;">s</span><span style="color: #2aa198;">)</span> -&gt; <span style="color: #268bd2;">void</span>;
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span><span style="color: #268bd2;">int</span> <span style="color: #2aa198;">main</span><span style="color: #2aa198;">()</span> <span style="color: #2aa198;">{</span>
<span class="linenr"> 5: </span>  <span style="color: #268bd2;">ellipse</span> <span style="color: #cb4b16;">e</span>;
<span class="linenr"> 6: </span>  calc<span style="color: #b58900;">(</span>e<span style="color: #b58900;">)</span>; <span style="color: #ff00ff;">// </span><span style="color: #ff00ff;">calls calc at line 2</span>
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span>  <span style="color: #268bd2;">rectangle</span> <span style="color: #cb4b16;">r</span>;
<span class="linenr"> 9: </span>  calc<span style="color: #b58900;">(</span>r<span style="color: #b58900;">)</span>; <span style="color: #ff00ff;">// </span><span style="color: #ff00ff;">ambiguous?</span>
<span class="linenr">10: </span><span style="color: #2aa198;">}</span>
</pre>
</div>

<div class="org-src-container">

<pre  class="src src-sh">&lt;source&gt;:38:5: error: call to <span style="color: #D01A4E;">'calc'</span> <span style="color: #859900;">is</span> ambiguous
    calc<span style="color: #2aa198;">(</span>r<span style="color: #2aa198;">)</span>;
    ^~~~
&lt;source&gt;:30:6: note: candidate <span style="color: #b58900; font-weight: bold;">function</span> <span style="color: #2aa198;">[</span>with s:auto = rectangle<span style="color: #2aa198;">]</span>
auto calc<span style="color: #2aa198;">(</span>shape auto const&amp; s<span style="color: #2aa198;">)</span> -&gt; void;
     ^
&lt;source&gt;:31:6: note: candidate <span style="color: #b58900; font-weight: bold;">function</span> <span style="color: #2aa198;">[</span>with s:auto = rectangle<span style="color: #2aa198;">]</span>
auto calc<span style="color: #2aa198;">(</span>basic_shape auto const&amp; s<span style="color: #2aa198;">)</span> -&gt; void;
</pre>
</div>

</section>
</section>
<section>
<section id="slide-org8efc235">
<h2 id="org8efc235">Constraining functions</h2>
<p>
Why isn't the function that takes a <code>shape</code><br />
more constrained than the function that takes a <code>basic_shape</code>?
</p>

<div class="org-src-container">

<pre  class="src src-c++"><span class="linenr"> 1: </span><span style="color: #b58900; font-weight: bold;">template</span> <span style="color: #2aa198;">&lt;</span><span style="color: #b58900; font-weight: bold;">typename</span> <span style="color: #268bd2;">T</span><span style="color: #2aa198;">&gt;</span>
<span class="linenr"> 2: </span><span style="color: #268bd2;">concept</span> <span style="color: #cb4b16;">basic_shape</span> = <span style="color: #b58900; font-weight: bold;">requires</span> <span style="color: #2aa198;">(</span><span style="color: #268bd2;">T</span> <span style="color: #cb4b16;">t</span><span style="color: #2aa198;">)</span> <span style="color: #2aa198;">{</span>
<span class="linenr"> 3: </span>  <span style="color: #b58900;">{</span> t.area<span style="color: #94BFF3;">()</span> <span style="color: #b58900;">}</span> -&gt; <span style="color: #859900;">std</span>::<span style="color: #268bd2;">same_as</span><span style="color: #b58900;">&lt;</span><span style="color: #859900;">std</span>::size_t<span style="color: #b58900;">&gt;</span>;
<span class="linenr"> 4: </span><span style="color: #2aa198;">}</span>;
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span><span style="color: #b58900; font-weight: bold;">template</span> <span style="color: #2aa198;">&lt;</span><span style="color: #b58900; font-weight: bold;">typename</span> <span style="color: #268bd2;">T</span><span style="color: #2aa198;">&gt;</span>
<span class="linenr"> 7: </span><span style="color: #268bd2;">concept</span> <span style="color: #cb4b16;">shape</span> = <span style="color: #b58900; font-weight: bold;">requires</span> <span style="color: #2aa198;">(</span><span style="color: #268bd2;">T</span> <span style="color: #cb4b16;">t</span><span style="color: #2aa198;">)</span> <span style="color: #2aa198;">{</span>
<span class="linenr"> 8: </span>  <span style="color: #268bd2;">basic_shape</span><span style="color: #b58900;">&lt;</span><span style="color: #268bd2;">T</span><span style="color: #b58900;">&gt;</span>; <span style="color: #ff00ff;">// </span><span style="color: #ff00ff;">DRY</span>
<span class="linenr"> 9: </span>  <span style="color: #b58900;">{</span> t.perimeter<span style="color: #94BFF3;">()</span> <span style="color: #b58900;">}</span> -&gt; <span style="color: #859900;">std</span>::<span style="color: #268bd2;">same_as</span><span style="color: #b58900;">&lt;</span><span style="color: #859900;">std</span>::size_t<span style="color: #b58900;">&gt;</span>;
<span class="linenr">10: </span><span style="color: #2aa198;">}</span>;
<span class="linenr">11: </span>
<span class="linenr">12: </span><span style="color: #b58900; font-weight: bold;">auto</span> <span style="color: #2aa198;">calc</span><span style="color: #2aa198;">(</span><span style="color: #268bd2;">shape</span> <span style="color: #b58900; font-weight: bold;">auto</span> <span style="color: #b58900; font-weight: bold;">const</span>&amp; <span style="color: #cb4b16;">s</span><span style="color: #2aa198;">)</span> -&gt; <span style="color: #268bd2;">void</span>;
<span class="linenr">13: </span><span style="color: #b58900; font-weight: bold;">auto</span> <span style="color: #2aa198;">calc</span><span style="color: #2aa198;">(</span><span style="color: #268bd2;">basic_shape</span> <span style="color: #b58900; font-weight: bold;">auto</span> <span style="color: #b58900; font-weight: bold;">const</span>&amp; <span style="color: #cb4b16;">s</span><span style="color: #2aa198;">)</span> -&gt; <span style="color: #268bd2;">void</span>;
</pre>
</div>

</section>
</section>
<section>
<section id="slide-orgcfceaf3">
<h2 id="orgcfceaf3">Concept subsumption</h2>
<p>
The answer is concept subsumption: how the compiler decides whether one concept
is "more powerful/constraining" another.
</p>

<div class="org-src-container">

<pre  class="src src-c++"><span class="linenr">1: </span><span style="color: #b58900; font-weight: bold;">auto</span> <span style="color: #2aa198;">calc</span><span style="color: #2aa198;">(</span><span style="color: #268bd2;">shape</span> <span style="color: #b58900; font-weight: bold;">auto</span> <span style="color: #b58900; font-weight: bold;">const</span>&amp; <span style="color: #cb4b16;">s</span><span style="color: #2aa198;">)</span> -&gt; <span style="color: #268bd2;">void</span>;
<span class="linenr">2: </span><span style="color: #b58900; font-weight: bold;">auto</span> <span style="color: #2aa198;">calc</span><span style="color: #2aa198;">(</span><span style="color: #268bd2;">basic_shape</span> <span style="color: #b58900; font-weight: bold;">auto</span> <span style="color: #b58900; font-weight: bold;">const</span>&amp; <span style="color: #cb4b16;">s</span><span style="color: #2aa198;">)</span> -&gt; <span style="color: #268bd2;">void</span>;
</pre>
</div>

<p>
To consider one (concept-constrained) function more constrained than another,
the concept(s) constraining function A must <i>subsume</i> the concept(s)
constraining function B.
</p>

<p>
What does that mean?
</p>

</section>
</section>
