presentation.org
* Concept subsumption

A constraint P /subsumes/ a constraint Q iff the compiler can prove that P
implies Q up to the identity of atomic constraints in P and Q.

 - convert P to /disjunctive normal form/ (OR of ANDs)
 - convert Q to /conjunctive normal form/ (AND of ORs)
 - check: {clauses in P} subsume {clauses in Q}

#+begin_src c++ -n
template <typename T>
concept basic_shape = requires (T t) {
  { t.area() } -> std::same_as<std::size_t>;
};

template <typename T>
concept shape = requires (T t) {
  basic_shape<T>; // DRY
  { t.perimeter() } -> std::same_as<std::size_t>;
};
#+end_src

* Concept subsumption rules

Basically, it works how you would expect:

 - ~A and B~ subsumes ~A~
 - ~A~ subsumes ~A~ (i.e. every concept subsumes itself)
 - ~A~ subsumes ~A or B~

A concept that subsumes another counts as more constrained.

* Concept subsumption rules

However, look out for the following gotchas:

/Only/ concepts can be subsumed\\
(you can use a ~constexpr bool~ as a clause in your concept,\\
but it can't take part in subsumption).

Only /atomic/ constraints are considered\\
(the compiler can't look inside your multi-part constraint).

* Concept subsumption

#+begin_src c++ -n
template <typename T>
concept basic_shape = requires (T t) {
  { t.area() } -> std::same_as<std::size_t>;
};

template <typename T>
concept shape =
  basic_shape<T>     // atomic constraint #1
  and
  requires (T t) {   // atomic constraint #2
    { t.perimeter() } -> std::same_as<std::size_t>;
  };
#+end_src

Now it is clearer why ~shape~ subsumes ~basic_shape~ (and why it didn't
originally).

* Variadic templates

#+begin_src c++ -n
auto variadic_calc(shape auto const&... ss) -> void;
auto variadic_calc(basic_shape auto const&... ss) -> void;

int main() {
  ellipse e;
  calc(e); // calls variadic_calc at line 2

  rectangle r;
  calc(r); // ambiguous again?
}
#+end_src

Oh no! What happened?

* Variadic templates

#+begin_src c++ -n
auto variadic_calc(shape auto const&... ss) -> void;
auto variadic_calc(basic_shape auto const&... ss) -> void;
#+end_src

is equivalent to

#+begin_src c++ -n
template <typename... Ts>
auto variadic_calc(const Ts&... ss) -> void requires (shape<Ts> and ...);
template <typename... Ts>
auto variadic_calc(const Ts&... ss) -> void requires (basic_shape<Ts> and ...);
#+end_src

And fold expressions are treated as atomic constraints!

The compiler can't look inside them, so\\
~requires (shape<Ts> and ...)~ /can't subsume/ ~requires (basic_shape<Ts> and ...)~

