presentation.html
<section>
<section id="slide-org5847d3c">
<h2 id="org5847d3c">Concept subsumption</h2>
<p>
A constraint P <i>subsumes</i> a constraint Q iff the compiler can prove that P
implies Q up to the identity of atomic constraints in P and Q.
</p>

<ul>
<li>convert P to <i>disjunctive normal form</i> (OR of ANDs)</li>
<li>convert Q to <i>conjunctive normal form</i> (AND of ORs)</li>
<li>check: {clauses in P} subsume {clauses in Q}</li>

</ul>

<div class="org-src-container">

<pre  class="src src-c++"><span class="linenr"> 1: </span><span style="color: #b58900; font-weight: bold;">template</span> <span style="color: #2aa198;">&lt;</span><span style="color: #b58900; font-weight: bold;">typename</span> <span style="color: #268bd2;">T</span><span style="color: #2aa198;">&gt;</span>
<span class="linenr"> 2: </span><span style="color: #268bd2;">concept</span> <span style="color: #cb4b16;">basic_shape</span> = <span style="color: #b58900; font-weight: bold;">requires</span> <span style="color: #2aa198;">(</span><span style="color: #268bd2;">T</span> <span style="color: #cb4b16;">t</span><span style="color: #2aa198;">)</span> <span style="color: #2aa198;">{</span>
<span class="linenr"> 3: </span>  <span style="color: #b58900;">{</span> t.area<span style="color: #94BFF3;">()</span> <span style="color: #b58900;">}</span> -&gt; <span style="color: #859900;">std</span>::<span style="color: #268bd2;">same_as</span><span style="color: #b58900;">&lt;</span><span style="color: #859900;">std</span>::size_t<span style="color: #b58900;">&gt;</span>;
<span class="linenr"> 4: </span><span style="color: #2aa198;">}</span>;
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span><span style="color: #b58900; font-weight: bold;">template</span> <span style="color: #2aa198;">&lt;</span><span style="color: #b58900; font-weight: bold;">typename</span> <span style="color: #268bd2;">T</span><span style="color: #2aa198;">&gt;</span>
<span class="linenr"> 7: </span><span style="color: #268bd2;">concept</span> <span style="color: #cb4b16;">shape</span> = <span style="color: #b58900; font-weight: bold;">requires</span> <span style="color: #2aa198;">(</span><span style="color: #268bd2;">T</span> <span style="color: #cb4b16;">t</span><span style="color: #2aa198;">)</span> <span style="color: #2aa198;">{</span>
<span class="linenr"> 8: </span>  <span style="color: #268bd2;">basic_shape</span><span style="color: #b58900;">&lt;</span><span style="color: #268bd2;">T</span><span style="color: #b58900;">&gt;</span>; <span style="color: #ff00ff;">// </span><span style="color: #ff00ff;">DRY</span>
<span class="linenr"> 9: </span>  <span style="color: #b58900;">{</span> t.perimeter<span style="color: #94BFF3;">()</span> <span style="color: #b58900;">}</span> -&gt; <span style="color: #859900;">std</span>::<span style="color: #268bd2;">same_as</span><span style="color: #b58900;">&lt;</span><span style="color: #859900;">std</span>::size_t<span style="color: #b58900;">&gt;</span>;
<span class="linenr">10: </span><span style="color: #2aa198;">}</span>;
</pre>
</div>

</section>
</section>
<section>
<section id="slide-orgf74e285">
<h2 id="orgf74e285">Concept subsumption rules</h2>
<p>
Basically, it works how you would expect:
</p>

<ul>
<li><code>A and B</code> subsumes <code>A</code></li>
<li><code>A</code> subsumes <code>A</code> (i.e. every concept subsumes itself)</li>
<li><code>A</code> subsumes <code>A or B</code></li>

</ul>

<p>
A concept that subsumes another counts as more constrained.
</p>

</section>
</section>
<section>
<section id="slide-org8c8cc8e">
<h2 id="org8c8cc8e">Concept subsumption rules</h2>
<p>
However, look out for the following gotchas:
</p>

<p>
<i>Only</i> concepts can be subsumed<br />
(you can use a <code>constexpr bool</code> as a clause in your concept,<br />
but it can't take part in subsumption).
</p>

<p>
Only <i>atomic</i> constraints are considered<br />
(the compiler can't look inside your multi-part constraint).
</p>

</section>
</section>
<section>
<section id="slide-orgde13b0a">
<h2 id="orgde13b0a">Concept subsumption</h2>
<div class="org-src-container">

<pre  class="src src-c++"><span class="linenr"> 1: </span><span style="color: #b58900; font-weight: bold;">template</span> <span style="color: #2aa198;">&lt;</span><span style="color: #b58900; font-weight: bold;">typename</span> <span style="color: #268bd2;">T</span><span style="color: #2aa198;">&gt;</span>
<span class="linenr"> 2: </span><span style="color: #268bd2;">concept</span> <span style="color: #cb4b16;">basic_shape</span> = <span style="color: #b58900; font-weight: bold;">requires</span> <span style="color: #2aa198;">(</span><span style="color: #268bd2;">T</span> <span style="color: #cb4b16;">t</span><span style="color: #2aa198;">)</span> <span style="color: #2aa198;">{</span>
<span class="linenr"> 3: </span>  <span style="color: #b58900;">{</span> t.area<span style="color: #94BFF3;">()</span> <span style="color: #b58900;">}</span> -&gt; <span style="color: #859900;">std</span>::<span style="color: #268bd2;">same_as</span><span style="color: #b58900;">&lt;</span><span style="color: #859900;">std</span>::size_t<span style="color: #b58900;">&gt;</span>;
<span class="linenr"> 4: </span><span style="color: #2aa198;">}</span>;
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span><span style="color: #b58900; font-weight: bold;">template</span> <span style="color: #2aa198;">&lt;</span><span style="color: #b58900; font-weight: bold;">typename</span> <span style="color: #268bd2;">T</span><span style="color: #2aa198;">&gt;</span>
<span class="linenr"> 7: </span><span style="color: #268bd2;">concept</span> <span style="color: #cb4b16;">shape</span> =
<span class="linenr"> 8: </span>  <span style="color: #268bd2;">basic_shape</span><span style="color: #2aa198;">&lt;</span><span style="color: #268bd2;">T</span><span style="color: #2aa198;">&gt;</span>     <span style="color: #ff00ff;">// </span><span style="color: #ff00ff;">atomic constraint #1</span>
<span class="linenr"> 9: </span>  <span style="color: #b58900; font-weight: bold;">and</span>
<span class="linenr">10: </span>  <span style="color: #b58900; font-weight: bold;">requires</span> <span style="color: #2aa198;">(</span><span style="color: #268bd2;">T</span> <span style="color: #cb4b16;">t</span><span style="color: #2aa198;">)</span> <span style="color: #2aa198;">{</span>   <span style="color: #ff00ff;">// </span><span style="color: #ff00ff;">atomic constraint #2</span>
<span class="linenr">11: </span>    <span style="color: #b58900;">{</span> t.perimeter<span style="color: #94BFF3;">()</span> <span style="color: #b58900;">}</span> -&gt; <span style="color: #859900;">std</span>::<span style="color: #268bd2;">same_as</span><span style="color: #b58900;">&lt;</span><span style="color: #859900;">std</span>::size_t<span style="color: #b58900;">&gt;</span>;
<span class="linenr">12: </span>  <span style="color: #2aa198;">}</span>;
</pre>
</div>

<p>
Now it is clearer why <code>shape</code> subsumes <code>basic_shape</code> (and why it didn't
originally).
</p>

</section>
</section>
<section>
<section id="slide-org827268b">
<h2 id="org827268b">Variadic templates</h2>
<div class="org-src-container">

<pre  class="src src-c++"><span class="linenr"> 1: </span><span style="color: #b58900; font-weight: bold;">auto</span> <span style="color: #2aa198;">variadic_calc</span><span style="color: #2aa198;">(</span><span style="color: #268bd2;">shape</span> <span style="color: #b58900; font-weight: bold;">auto</span> <span style="color: #b58900; font-weight: bold;">const</span>&amp;<span style="color: #2aa198;">...</span> <span style="color: #cb4b16;">ss</span><span style="color: #2aa198;">)</span> -&gt; <span style="color: #268bd2;">void</span>;
<span class="linenr"> 2: </span><span style="color: #b58900; font-weight: bold;">auto</span> <span style="color: #2aa198;">variadic_calc</span><span style="color: #2aa198;">(</span><span style="color: #268bd2;">basic_shape</span> <span style="color: #b58900; font-weight: bold;">auto</span> <span style="color: #b58900; font-weight: bold;">const</span>&amp;<span style="color: #2aa198;">...</span> <span style="color: #cb4b16;">ss</span><span style="color: #2aa198;">)</span> -&gt; <span style="color: #268bd2;">void</span>;
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span><span style="color: #268bd2;">int</span> <span style="color: #2aa198;">main</span><span style="color: #2aa198;">()</span> <span style="color: #2aa198;">{</span>
<span class="linenr"> 5: </span>  <span style="color: #268bd2;">ellipse</span> <span style="color: #cb4b16;">e</span>;
<span class="linenr"> 6: </span>  calc<span style="color: #b58900;">(</span>e<span style="color: #b58900;">)</span>; <span style="color: #ff00ff;">// </span><span style="color: #ff00ff;">calls variadic_calc at line 2</span>
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span>  <span style="color: #268bd2;">rectangle</span> <span style="color: #cb4b16;">r</span>;
<span class="linenr"> 9: </span>  calc<span style="color: #b58900;">(</span>r<span style="color: #b58900;">)</span>; <span style="color: #ff00ff;">// </span><span style="color: #ff00ff;">ambiguous again?</span>
<span class="linenr">10: </span><span style="color: #2aa198;">}</span>
</pre>
</div>

<p>
Oh no! What happened?
</p>

</section>
</section>
<section>
<section id="slide-org6be7e7d">
<h2 id="org6be7e7d">Variadic templates</h2>
<div class="org-src-container">

<pre  class="src src-c++"><span class="linenr">1: </span><span style="color: #b58900; font-weight: bold;">auto</span> <span style="color: #2aa198;">variadic_calc</span><span style="color: #2aa198;">(</span><span style="color: #268bd2;">shape</span> <span style="color: #b58900; font-weight: bold;">auto</span> <span style="color: #b58900; font-weight: bold;">const</span>&amp;<span style="color: #2aa198;">...</span> <span style="color: #cb4b16;">ss</span><span style="color: #2aa198;">)</span> -&gt; <span style="color: #268bd2;">void</span>;
<span class="linenr">2: </span><span style="color: #b58900; font-weight: bold;">auto</span> <span style="color: #2aa198;">variadic_calc</span><span style="color: #2aa198;">(</span><span style="color: #268bd2;">basic_shape</span> <span style="color: #b58900; font-weight: bold;">auto</span> <span style="color: #b58900; font-weight: bold;">const</span>&amp;<span style="color: #2aa198;">...</span> <span style="color: #cb4b16;">ss</span><span style="color: #2aa198;">)</span> -&gt; <span style="color: #268bd2;">void</span>;
</pre>
</div>

<p>
is equivalent to
</p>

<div class="org-src-container">

<pre  class="src src-c++"><span class="linenr">1: </span><span style="color: #b58900; font-weight: bold;">template</span> <span style="color: #2aa198;">&lt;</span><span style="color: #b58900; font-weight: bold;">typename</span><span style="color: #2aa198;">...</span> <span style="color: #268bd2;">Ts</span><span style="color: #2aa198;">&gt;</span>
<span class="linenr">2: </span><span style="color: #b58900; font-weight: bold;">auto</span> <span style="color: #2aa198;">variadic_calc</span><span style="color: #2aa198;">(</span><span style="color: #b58900; font-weight: bold;">const</span> <span style="color: #268bd2;">Ts</span>&amp;<span style="color: #2aa198;">...</span> <span style="color: #cb4b16;">ss</span><span style="color: #2aa198;">)</span> -&gt; <span style="color: #268bd2;">void</span> <span style="color: #b58900; font-weight: bold;">requires</span> <span style="color: #2aa198;">(</span><span style="color: #268bd2;">shape</span><span style="color: #b58900;">&lt;</span><span style="color: #268bd2;">Ts</span><span style="color: #b58900;">&gt;</span> <span style="color: #b58900; font-weight: bold;">and</span> <span style="color: #2aa198;">...</span><span style="color: #2aa198;">)</span>;
<span class="linenr">3: </span><span style="color: #b58900; font-weight: bold;">template</span> <span style="color: #2aa198;">&lt;</span><span style="color: #b58900; font-weight: bold;">typename</span><span style="color: #2aa198;">...</span> <span style="color: #268bd2;">Ts</span><span style="color: #2aa198;">&gt;</span>
<span class="linenr">4: </span><span style="color: #b58900; font-weight: bold;">auto</span> <span style="color: #2aa198;">variadic_calc</span><span style="color: #2aa198;">(</span><span style="color: #b58900; font-weight: bold;">const</span> <span style="color: #268bd2;">Ts</span>&amp;<span style="color: #2aa198;">...</span> <span style="color: #cb4b16;">ss</span><span style="color: #2aa198;">)</span> -&gt; <span style="color: #268bd2;">void</span> <span style="color: #b58900; font-weight: bold;">requires</span> <span style="color: #2aa198;">(</span><span style="color: #268bd2;">basic_shape</span><span style="color: #b58900;">&lt;</span><span style="color: #268bd2;">Ts</span><span style="color: #b58900;">&gt;</span> <span style="color: #b58900; font-weight: bold;">and</span> <span style="color: #2aa198;">...</span><span style="color: #2aa198;">)</span>;
</pre>
</div>

<p>
And fold expressions are treated as atomic constraints!
</p>

<p>
The compiler can't look inside them, so<br />
<code>requires (shape&lt;Ts&gt; and ...)</code> <i>can't subsume</i> <code>requires (basic_shape&lt;Ts&gt; and ...)</code>
</p>

</section>
</section>
